In [2]:
import pandas as pd

In [4]:
df = pd.read_csv("titanic.csv")

In [6]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [8]:
df.loc[5]

PassengerId                   6
Survived                      0
Pclass                        3
Name           Moran, Mr. James
Sex                        male
Age                         NaN
SibSp                         0
Parch                         0
Ticket                   330877
Fare                     8.4583
Cabin                       NaN
Embarked                      Q
Name: 5, dtype: object

In [10]:
df.at[5, 'Age'] = 28
df.head(6)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,50.0,0,0,330877,8.4583,NaN,Q

In [22]:
count = 0 
for i in range(0, len(df)):
    if(df.iloc[i]['Age'] > 18):
      count= count +1
print(count)

576

In [20]:
male = 0 
for j in range(0, len(df)):
    if(df.iloc[j]['Sex'] == 'male'):
      male= male +1
male

577

In [23]:
male = 0
for j in range(0, len(df)):
    if (df.iloc[j]['Sex'] == 'male'):
        male+=1
total = len(df)
percentage = male/total
percentage * 100

64.75869809203144